app/Http/Controllers/Admin/DummyController.php

select * from `dummies` where `status_id` = 3 order by `id` asc limit 20 offset 0
select * from `statuses` where `statuses`.`id` in (1, 2, 3, 4, 5) and `statuses`.`deleted_at` is null
select count(*) as aggregate from `dummies`
select * from `statuses` where `statuses`.`deleted_at` is null
---
    public function index()
    {

        foreach (Dummy::$customizable['index']['fields'] as $field){
            if (isset($field['filterProps']['relation'])){
                $plural_field = Str::plural($field['filterProps']['relation']['name']);
                $class = Str::plural($field['filterProps']['relation']['name'], 1);
                $class = Str::ucfirst($class);
                $class ='App\Models\\'.$class;
                $elements = $class::all();
                $this->data[$plural_field] = $elements;
            }
        }
        $dummies = Dummy::query()
            ->with(['status'])
            ->customSearch()
            ->customSort()
            ->withTrashed()
            ->orderBy('id')->paginate(20)->withQueryString();
        $this->data['items'] = DummyResource::collection($dummies);
        $this->data['filters'] = request()->all(['search' , 'field' , 'direction']);